#### Terraform format and style 🖌`success`
#### Terraform initialization ⚙️`success`
#### Terraform validation 🤖`Success! The configuration is valid.

`
#### Terraform plan 📖`success`

<details><summary>Show plan</summary>

```

terraform
[0m[33mRunning plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/dosedecafeine/go-example-argocd/runs/run-ceTdim8Qc2VyZTqu[0m
[0m
Waiting for the plan to start...

Terraform v1.1.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_ecr_repository.main[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ecr_repository" "main" {
      [32m+[0m [0m[1m[0marn[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mimage_tag_mutability[0m[0m = "MUTABLE"
      [32m+[0m [0m[1m[0mname[0m[0m                 = "go-example-argocd"
      [32m+[0m [0m[1m[0mregistry_id[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mrepository_url[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mtags_all[0m[0m             = (known after apply)

      [32m+[0m [0mimage_scanning_configuration {
          [32m+[0m [0m[1m[0mscan_on_push[0m[0m = true
        }
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m

```

</details>

*Pusher: @danielvincenzi, Action: `pull_request`, Working directory: ``, Workflow: `Terraform`*